NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/bootloader/src/dfu_mesh.c
    if (m_state == DFU_STATE_FIND_FWID)
    {
        /* always upgrade bootloader first */
        if (bootloader_is_newer(p_packet->payload.fwid.bootloader))
        {
            __LOG("\tBootloader upgrade possible\n");
            bl_evt_t fwid_evt;
            fwid_evt.type = BL_EVT_TYPE_DFU_NEW_FW;
            fwid_evt.params.dfu.new_fw.fw_type = DFU_TYPE_BOOTLOADER;
            fwid_evt.params.dfu.new_fw.fwid.bootloader.id  = p_packet->payload.fwid.bootloader.id;
            fwid_evt.params.dfu.new_fw.fwid.bootloader.ver = p_packet->payload.fwid.bootloader.ver;
            fwid_evt.params.dfu.new_fw.state = m_state;
            status = bootloader_evt_send(&fwid_evt);
        }
        else if (app_is_newer(&p_packet->payload.fwid.app))
        {
            /* SD shall only be upgraded if a newer version of our app requires a different SD */
            if (p_packet->payload.fwid.sd != 0xFFFE && p_packet->payload.fwid.sd != m_bl_info_pointers.p_fwid->sd)
            {
                __LOG("\tSD upgrade possible\n");
                bl_evt_t fwid_evt;
                fwid_evt.type = BL_EVT_TYPE_DFU_NEW_FW;
                fwid_evt.params.dfu.new_fw.fw_type = DFU_TYPE_SD;
                fwid_evt.params.dfu.new_fw.fwid.sd = p_packet->payload.fwid.sd;
                fwid_evt.params.dfu.new_fw.state = m_state;
                status = bootloader_evt_send(&fwid_evt);
            }
            else
            {
                __LOG("\tApp upgrade possible\n");
                bl_evt_t fwid_evt;
                fwid_evt.type = BL_EVT_TYPE_DFU_NEW_FW;
                fwid_evt.params.dfu.new_fw.fw_type = DFU_TYPE_APP;
                fwid_evt.params.dfu.new_fw.state = m_state;
                memcpy(&fwid_evt.params.dfu.new_fw.fwid.app, &p_packet->payload.fwid.app, sizeof(app_id_t));
                status = bootloader_evt_send(&fwid_evt);
            }
        }
        else
        {
            status = NRF_ERROR_INVALID_DATA;
        }
    }
    else
    {
        status = NRF_ERROR_INVALID_STATE;
    }
    return status;
}

static uint32_t handle_data_req_packet(dfu_packet_t* p_packet)
{
    uint32_t status;
    if (p_packet->payload.data.transaction_id == m_transaction.transaction_id)
    {
        __LOG("RX data REQ #%u\n", p_packet->payload.data.segment);
        if (m_state == DFU_STATE_RELAY)
        {
            /* only relay new packets, look for it in cache */
            if (packet_in_cache(p_packet))
            {
                status = NRF_SUCCESS;
            }
            else
            {
                status = relay_packet(p_packet, DFU_PACKET_LEN_DATA_REQ);

#if RBC_MESH_SERIAL
                bl_evt_t tx_evt;
                tx_evt.type = BL_EVT_TYPE_TX_SERIAL;
                tx_evt.params.tx.serial.p_dfu_packet = p_packet;
                tx_evt.params.tx.serial.length = DFU_PACKET_LEN_DATA_REQ;
                (void) bootloader_evt_send(&tx_evt);
#endif
            }
        }
        else /* In transfer */
        {
            req_cache_entry_t* p_req_entry = NULL;
            /* check that we haven't served this request recently. */
            for (uint32_t i = 0; i < REQ_CACHE_SIZE; ++i)
            {
                if (m_req_cache[i].segment == p_packet->payload.req_data.segment)
                {
                    if (m_req_cache[i].rx_count++ < REQ_RX_COUNT_RETRY)
                    {
                        return NRF_SUCCESS;
                    }
                    p_req_entry = &m_req_cache[i];
                    break;
                }
            }
            /* serve request */
            dfu_packet_t dfu_rsp;
            if (
                dfu_transfer_has_entry(
                    (uint32_t*) SEGMENT_ADDR(p_packet->payload.req_data.segment, m_transaction.p_start_addr),
                    dfu_rsp.payload.rsp_data.data, SEGMENT_LENGTH)
               )
            {
                dfu_rsp.packet_type = DFU_PACKET_TYPE_DATA_RSP;
                dfu_rsp.payload.rsp_data.segment = p_packet->payload.req_data.segment;
                dfu_rsp.payload.rsp_data.transaction_id = p_packet->payload.req_data.transaction_id;

                status = packet_tx_dynamic(&dfu_rsp, DFU_PACKET_LEN_DATA_RSP, TX_INTERVAL_TYPE_RSP, TX_REPEATS_RSP);
            }
            else
            {
                status = NRF_ERROR_NOT_FOUND;
            }

            /* log our attempt at responding */
            if ((status == NRF_SUCCESS) && (p_req_entry == NULL))
            {
                p_req_entry = &m_req_cache[(m_req_index++) & (REQ_CACHE_SIZE - 1)];
                p_req_entry->segment = p_packet->payload.req_data.segment;
            }

            /* Check that p_req_enry is not NULL, if status is not NRF_SUCCESS. If status is 
               NRF_SUCCESS, p_req_entry will always be set. */
            if (p_req_entry != NULL)
            {
                p_req_entry->rx_count = 0;
            }
        }
    }
    else
    {
        status = NRF_ERROR_INVALID_DATA;
    }
    return status;
}

static uint32_t handle_data_rsp_packet(dfu_packet_t* p_packet, uint16_t length)
{
    uint32_t status;
    if (m_state == DFU_STATE_RELAY)
    {
        /* only relay new packets, look for it in cache */
        if (packet_in_cache(p_packet))
        {
            status = NRF_SUCCESS;
        }
        else
        {
            send_progress_event(m_transaction.segment_count - m_transaction.segments_remaining + 1,
                    m_transaction.segment_count);
            status = relay_packet(p_packet, length);
        }
    }
    else
    {
        status = handle_data_packet(p_packet, length);
    }
    return status;
}

/*****************************************************************************
* Interface Functions
*****************************************************************************/

void dfu_mesh_init(uint8_t tx_slots)
{
    SET_STATE(DFU_STATE_INITIALIZED);
    memset(&m_transaction, 0, sizeof(transaction_t));
    memset(m_req_cache, 0, REQ_CACHE_SIZE * sizeof(m_req_cache[0]));
    m_req_index = 0;
    m_tx_slots = tx_slots;

    get_info_pointers();
}

void dfu_mesh_start(void)
{
    memset(&m_transaction, 0, sizeof(transaction_t));
    memset(m_req_cache, 0, sizeof(req_cache_entry_t) * REQ_CACHE_SIZE);
    m_req_index = 0;
    m_data_req_segment = false;
    get_info_pointers();
    send_bank_notifications();
    packet_cache_flush();

    if (!dfu_bank_transfer_in_progress())
    {
        __LOG("DFU mesh start: \n");
        __LOG("\tAPP: %08x.%04x:%08x\n",
                (uint32_t) m_bl_info_pointers.p_fwid->app.company_id,
                (uint32_t) m_bl_info_pointers.p_fwid->app.app_id,
                (uint32_t) m_bl_info_pointers.p_fwid->app.app_version);
        __LOG("\tSD:  %04x\n",
                (uint32_t) m_bl_info_pointers.p_fwid->sd);
        __LOG("\tBL:  %02x:%02x\n",
                (uint32_t) m_bl_info_pointers.p_fwid->bootloader.id,
                (uint32_t) m_bl_info_pointers.p_fwid->bootloader.ver);

        start_find_fwid();
    }
    else
    {
        __LOG("Bank Transfer in progress!\n");
        SET_STATE(DFU_STATE_INITIALIZED);
    }
}

uint32_t dfu_mesh_req(dfu_type_t type, fwid_union_t* p_fwid, uint32_t* p_bank_addr)
{
    if (m_state != DFU_STATE_FIND_FWID)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if ((uint32_t) p_bank_addr >= BOOTLOADERADDR() &&
        (uint32_t) p_bank_addr != 0xFFFFFFFF)
    {
        __LOG("Attempting to overwrite bootloader\n");
        return NRF_ERROR_INVALID_ADDR;
    }

    __LOG("REQUESTING TRANSFER OF %s\n", m_dfu_type_strs[(uint32_t) type]);
    m_transaction.p_bank_addr = p_bank_addr;
    start_req(type, p_fwid);

    return NRF_SUCCESS;
}

uint32_t dfu_mesh_relay(dfu_type_t type, fwid_union_t* p_fwid, uint32_t transaction_id)
{
    if (m_state != DFU_STATE_FIND_FWID &&
        m_state != DFU_STATE_DFU_REQ)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    __LOG("Relay transfer of %s (TID=0x%x)\n", m_dfu_type_strs[type], transaction_id);

    SET_STATE(DFU_STATE_RELAY_CANDIDATE);
    m_transaction.type = type;
    m_transaction.transaction_id = transaction_id;
    fwid_union_cpy(
            &m_transaction.target_fwid_union,
            p_fwid,
            type);
    beacon_set(state_beacon_type(m_transaction.type));
    return NRF_SUCCESS;
}

uint32_t dfu_mesh_rx(dfu_packet_t* p_packet, uint16_t length, bool from_serial)
{
#ifdef DEBUG_LEDS
    static bool led = false;
    if (led)
    {
        NRF_GPIO->OUTCLR = LED_2;
    }
    else
    {
        NRF_GPIO->OUTSET = LED_2;
    }
    led = !led;
#endif
    uint32_t status;

    switch (p_packet->packet_type)
    {
        case DFU_PACKET_TYPE_FWID:
            status = handle_fwid_packet(p_packet);
            break;

        case DFU_PACKET_TYPE_STATE:
            status = handle_state_packet(p_packet);
            break;

        case DFU_PACKET_TYPE_DATA:
            status = handle_data_packet(p_packet, length);
            break;

